app/controllers/users_controller.rb

  def show
    @user = User.find_by id: params[:id]
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('tanhvnpd02584', 'omgod234@gmail.com', '2020-05-25 14:36:34.305009', '2020-05-25 14:36:34.305009', '$2a$10$YK9638D0Dvs1SPOagK7u0OXvTKa78MHPpYULm3Sy2p0aucsnlxXES')